; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain ballooning)
     (:requirements :typing :fluents)
     (:types
          balloon passenger - object
     )
     (:predicates
          (rescued ?t - passenger)
     )
     (:functions
          (col ?b - balloon)
          (row ?b - balloon)
          (band ?t - passenger)
     )
     ;; Increment the value in the given counter by one
     (:action drift_northeast
          :parameters (?b - balloon)
          :precondition (and)
          :effect (and(increase (col ?b) 1.5) (increase (row ?b) 1.5))
     )
     (:action drift_northwest
          :parameters (?b - balloon)
          :precondition (and)
          :effect (and(decrease (col ?b) 1.5) (increase (row ?b) 1.5))
     )
     (:action drift_east
          :parameters (?b - balloon)
          :precondition (and)
          :effect (and(increase (col ?b) 3))
     )
     (:action drift_west
          :parameters (?b - balloon)
          :precondition (and)
          :effect (and(decrease (col ?b) 3))
     )
     (:action drift_southwest
          :parameters(?b - balloon)
          :precondition (and)
          :effect (and(increase (col ?b) 2) (decrease (row ?b) 2))
     )
     (:action drift_southeast
          :parameters(?b - balloon)
          :precondition (and)
          :effect (and(decrease (col ?b) 2) (decrease (row ?b) 2))
     )
     (:action drift_south
          :parameters(?b - balloon)
          :precondition (and)
          :effect (and (decrease (row ?b) 2))
     )
     (:action rescue_passenger
          :parameters(?b - balloon ?t - passenger)
          :precondition ( and (>= (+ (col ?b) (row ?b)) (band ?t))
               (>= (- (row ?b) (col ?b)) (band ?t))
               (<= (+ (col ?b) (row ?b)) (+ (band ?t) 25))
               (<= (- (row ?b) (col ?b)) (+ (band ?t) 25))
          )
          :effect (and(rescued ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem ballooning-p01)

  (:domain ballooning)

  (:objects
    g1 - balloon
    r0 r1 - passenger
  )

  (:init
    (= (col g1) 3)
    (= (row g1) 0)

    (= (band r0) 120)
    (= (band r1) 59)

  )

  (:goal
    (and
      (rescued r0)
      (rescued r1)

    )
  )
)

; plan
1. (drift_northeast g1)
   changed: (col g1) from 3 to 4.5, (row g1) from 0 to 1.5
   goals met: 0 of 2
2. (drift_northwest g1)
   changed: (col g1) from 4.5 to 3, (row g1) from 1.5 to 3
   goals met: 0 of 2
3. (drift_northwest g1)
   changed: (col g1) from 3 to 1.5, (row g1) from 3 to 4.5
   goals met: 0 of 2
4. (drift_northwest g1)
   changed: (col g1) from 1.5 to 0, (row g1) from 4.5 to 6
   goals met: 0 of 2
5. (drift_northwest g1)
   changed: (col g1) from 0 to -1.5, (row g1) from 6 to 7.5
   goals met: 0 of 2
6. (drift_northwest g1)
   changed: (col g1) from -1.5 to -3, (row g1) from 7.5 to 9
   goals met: 0 of 2
7. (drift_northwest g1)
   changed: (col g1) from -3 to -4.5, (row g1) from 9 to 10.5
   goals met: 0 of 2
8. (drift_northwest g1)
   changed: (col g1) from -4.5 to -6, (row g1) from 10.5 to 12
   goals met: 0 of 2
9. (drift_northwest g1)
   changed: (col g1) from -6 to -7.5, (row g1) from 12 to 13.5
   goals met: 0 of 2
10. (drift_northwest g1)
   changed: (col g1) from -7.5 to -9, (row g1) from 13.5 to 15
   goals met: 0 of 2
11. (drift_northwest g1)
   changed: (col g1) from -9 to -10.5, (row g1) from 15 to 16.5
   goals met: 0 of 2
12. (drift_northwest g1)
   changed: (col g1) from -10.5 to -12, (row g1) from 16.5 to 18
   goals met: 0 of 2
13. (drift_northwest g1)
   changed: (col g1) from -12 to -13.5, (row g1) from 18 to 19.5
   goals met: 0 of 2
14. (drift_northwest g1)
   changed: (col g1) from -13.5 to -15, (row g1) from 19.5 to 21
   goals met: 0 of 2
15. (drift_northwest g1)
   changed: (col g1) from -15 to -16.5, (row g1) from 21 to 22.5
   goals met: 0 of 2
16. (drift_northwest g1)
   changed: (col g1) from -16.5 to -18, (row g1) from 22.5 to 24
   goals met: 0 of 2
17. (drift_northwest g1)
   changed: (col g1) from -18 to -19.5, (row g1) from 24 to 25.5
   goals met: 0 of 2
18. (drift_northwest g1)
   changed: (col g1) from -19.5 to -21, (row g1) from 25.5 to 27
   goals met: 0 of 2
19. (drift_northwest g1)
   changed: (col g1) from -21 to -22.5, (row g1) from 27 to 28.5
   goals met: 0 of 2
20. (drift_northwest g1)
   changed: (col g1) from -22.5 to -24, (row g1) from 28.5 to 30
   goals met: 0 of 2
21. (drift_northwest g1)
   changed: (col g1) from -24 to -25.5, (row g1) from 30 to 31.5
   goals met: 0 of 2
22. (drift_northwest g1)
   changed: (col g1) from -25.5 to -27, (row g1) from 31.5 to 33
   goals met: 0 of 2
23. (drift_northwest g1)
   changed: (col g1) from -27 to -28.5, (row g1) from 33 to 34.5
   goals met: 0 of 2
24. (drift_northwest g1)
   changed: (col g1) from -28.5 to -30, (row g1) from 34.5 to 36
   goals met: 0 of 2
25. (drift_northwest g1)
   changed: (col g1) from -30 to -31.5, (row g1) from 36 to 37.5
   goals met: 0 of 2
26. (drift_northwest g1)
   changed: (col g1) from -31.5 to -33, (row g1) from 37.5 to 39
   goals met: 0 of 2
27. (drift_northwest g1)
   changed: (col g1) from -33 to -34.5, (row g1) from 39 to 40.5
   goals met: 0 of 2
28. (drift_northwest g1)
   changed: (col g1) from -34.5 to -36, (row g1) from 40.5 to 42
   goals met: 0 of 2
29. (drift_northwest g1)
   changed: (col g1) from -36 to -37.5, (row g1) from 42 to 43.5
   goals met: 0 of 2
30. (drift_northwest g1)
   changed: (col g1) from -37.5 to -39, (row g1) from 43.5 to 45
   goals met: 0 of 2
31. (drift_northwest g1)
   changed: (col g1) from -39 to -40.5, (row g1) from 45 to 46.5
   goals met: 0 of 2
32. (drift_northwest g1)
   changed: (col g1) from -40.5 to -42, (row g1) from 46.5 to 48
   goals met: 0 of 2
33. (drift_northwest g1)
   changed: (col g1) from -42 to -43.5, (row g1) from 48 to 49.5
   goals met: 0 of 2
34. (drift_northwest g1)
   changed: (col g1) from -43.5 to -45, (row g1) from 49.5 to 51
   goals met: 0 of 2
35. (drift_northwest g1)
   changed: (col g1) from -45 to -46.5, (row g1) from 51 to 52.5
   goals met: 0 of 2
36. (drift_northwest g1)
   changed: (col g1) from -46.5 to -48, (row g1) from 52.5 to 54
   goals met: 0 of 2
37. (drift_northeast g1)
   changed: (col g1) from -48 to -46.5, (row g1) from 54 to 55.5
   goals met: 0 of 2
38. (drift_northeast g1)
   changed: (col g1) from -46.5 to -45, (row g1) from 55.5 to 57
   goals met: 0 of 2
39. (drift_northeast g1)
   changed: (col g1) from -45 to -43.5, (row g1) from 57 to 58.5
   goals met: 0 of 2
40. (drift_northeast g1)
   changed: (col g1) from -43.5 to -42, (row g1) from 58.5 to 60
   goals met: 0 of 2
41. (drift_northeast g1)
   changed: (col g1) from -42 to -40.5, (row g1) from 60 to 61.5
   goals met: 0 of 2
42. (drift_northeast g1)
   changed: (col g1) from -40.5 to -39, (row g1) from 61.5 to 63
   goals met: 0 of 2
43. (drift_northeast g1)
   changed: (col g1) from -39 to -37.5, (row g1) from 63 to 64.5
   goals met: 0 of 2
44. (drift_northeast g1)
   changed: (col g1) from -37.5 to -36, (row g1) from 64.5 to 66
   goals met: 0 of 2
45. (drift_northeast g1)
   changed: (col g1) from -36 to -34.5, (row g1) from 66 to 67.5
   goals met: 0 of 2
46. (drift_northeast g1)
   changed: (col g1) from -34.5 to -33, (row g1) from 67.5 to 69
   goals met: 0 of 2
47. (drift_northeast g1)
   changed: (col g1) from -33 to -31.5, (row g1) from 69 to 70.5
   goals met: 0 of 2
48. (drift_northeast g1)
   changed: (col g1) from -31.5 to -30, (row g1) from 70.5 to 72
   goals met: 0 of 2
49. (drift_northeast g1)
   changed: (col g1) from -30 to -28.5, (row g1) from 72 to 73.5
   goals met: 0 of 2
50. (drift_northeast g1)
   changed: (col g1) from -28.5 to -27, (row g1) from 73.5 to 75
   goals met: 0 of 2
51. (drift_northeast g1)
   changed: (col g1) from -27 to -25.5, (row g1) from 75 to 76.5
   goals met: 0 of 2
52. (drift_northeast g1)
   changed: (col g1) from -25.5 to -24, (row g1) from 76.5 to 78
   goals met: 0 of 2
53. (drift_northeast g1)
   changed: (col g1) from -24 to -22.5, (row g1) from 78 to 79.5
   goals met: 0 of 2
54. (drift_northeast g1)
   changed: (col g1) from -22.5 to -21, (row g1) from 79.5 to 81
   goals met: 0 of 2
55. (drift_northeast g1)
   changed: (col g1) from -21 to -19.5, (row g1) from 81 to 82.5
   goals met: 0 of 2
56. (drift_northeast g1)
   changed: (col g1) from -19.5 to -18, (row g1) from 82.5 to 84
   goals met: 0 of 2
57. (drift_northeast g1)
   changed: (col g1) from -18 to -16.5, (row g1) from 84 to 85.5
   goals met: 0 of 2
58. (drift_northeast g1)
   changed: (col g1) from -16.5 to -15, (row g1) from 85.5 to 87
   goals met: 0 of 2
59. (drift_northeast g1)
   changed: (col g1) from -15 to -13.5, (row g1) from 87 to 88.5
   goals met: 0 of 2
60. (drift_northeast g1)
   changed: (col g1) from -13.5 to -12, (row g1) from 88.5 to 90
   goals met: 0 of 2
61. (drift_northeast g1)
   changed: (col g1) from -12 to -10.5, (row g1) from 90 to 91.5
   goals met: 0 of 2
62. (drift_northeast g1)
   changed: (col g1) from -10.5 to -9, (row g1) from 91.5 to 93
   goals met: 0 of 2
63. (drift_northeast g1)
   changed: (col g1) from -9 to -7.5, (row g1) from 93 to 94.5
   goals met: 0 of 2
64. (drift_northeast g1)
   changed: (col g1) from -7.5 to -6, (row g1) from 94.5 to 96
   goals met: 0 of 2
65. (drift_northeast g1)
   changed: (col g1) from -6 to -4.5, (row g1) from 96 to 97.5
   goals met: 0 of 2
66. (drift_northeast g1)
   changed: (col g1) from -4.5 to -3, (row g1) from 97.5 to 99
   goals met: 0 of 2
67. (drift_northeast g1)
   changed: (col g1) from -3 to -1.5, (row g1) from 99 to 100.5
   goals met: 0 of 2
68. (drift_northeast g1)
   changed: (col g1) from -1.5 to 0, (row g1) from 100.5 to 102
   goals met: 0 of 2
69. (drift_northwest g1)
   changed: (col g1) from 0 to -1.5, (row g1) from 102 to 103.5
   goals met: 0 of 2
70. (drift_northwest g1)
   changed: (col g1) from -1.5 to -3, (row g1) from 103.5 to 105
   goals met: 0 of 2
71. (drift_northwest g1)
   changed: (col g1) from -3 to -4.5, (row g1) from 105 to 106.5
   goals met: 0 of 2
72. (drift_northwest g1)
   changed: (col g1) from -4.5 to -6, (row g1) from 106.5 to 108
   goals met: 0 of 2
73. (drift_northwest g1)
   changed: (col g1) from -6 to -7.5, (row g1) from 108 to 109.5
   goals met: 0 of 2
74. (drift_northwest g1)
   changed: (col g1) from -7.5 to -9, (row g1) from 109.5 to 111
   goals met: 0 of 2
75. (drift_northeast g1)
   changed: (col g1) from -9 to -7.5, (row g1) from 111 to 112.5
   goals met: 0 of 2
76. (drift_northeast g1)
   changed: (col g1) from -7.5 to -6, (row g1) from 112.5 to 114
   goals met: 0 of 2
77. (drift_northeast g1)
   changed: (col g1) from -6 to -4.5, (row g1) from 114 to 115.5
   goals met: 0 of 2
78. (drift_northeast g1)
   changed: (col g1) from -4.5 to -3, (row g1) from 115.5 to 117
   goals met: 0 of 2
79. (drift_northeast g1)
   changed: (col g1) from -3 to -1.5, (row g1) from 117 to 118.5
   goals met: 0 of 2
80. (drift_northeast g1)
   changed: (col g1) from -1.5 to 0, (row g1) from 118.5 to 120
   goals met: 0 of 2
81. (rescue_passenger g1 r0)
   added: (rescued r0)
   goals met: 1 of 2
82. (drift_southwest g1)
   changed: (col g1) from 0 to 2, (row g1) from 120 to 118
   goals met: 1 of 2
83. (drift_southwest g1)
   changed: (col g1) from 2 to 4, (row g1) from 118 to 116
   goals met: 1 of 2
84. (drift_southwest g1)
   changed: (col g1) from 4 to 6, (row g1) from 116 to 114
   goals met: 1 of 2
85. (drift_southeast g1)
   changed: (col g1) from 6 to 4, (row g1) from 114 to 112
   goals met: 1 of 2
86. (drift_southeast g1)
   changed: (col g1) from 4 to 2, (row g1) from 112 to 110
   goals met: 1 of 2
87. (drift_southeast g1)
   changed: (col g1) from 2 to 0, (row g1) from 110 to 108
   goals met: 1 of 2
88. (drift_southwest g1)
   changed: (col g1) from 0 to 2, (row g1) from 108 to 106
   goals met: 1 of 2
89. (drift_southwest g1)
   changed: (col g1) from 2 to 4, (row g1) from 106 to 104
   goals met: 1 of 2
90. (drift_southwest g1)
   changed: (col g1) from 4 to 6, (row g1) from 104 to 102
   goals met: 1 of 2
91. (drift_southwest g1)
   changed: (col g1) from 6 to 8, (row g1) from 102 to 100
   goals met: 1 of 2
92. (drift_southwest g1)
   changed: (col g1) from 8 to 10, (row g1) from 100 to 98
   goals met: 1 of 2
93. (drift_southwest g1)
   changed: (col g1) from 10 to 12, (row g1) from 98 to 96
   goals met: 1 of 2
94. (drift_southeast g1)
   changed: (col g1) from 12 to 10, (row g1) from 96 to 94
   goals met: 1 of 2
95. (drift_southeast g1)
   changed: (col g1) from 10 to 8, (row g1) from 94 to 92
   goals met: 1 of 2
96. (drift_southeast g1)
   changed: (col g1) from 8 to 6, (row g1) from 92 to 90
   goals met: 1 of 2
97. (drift_southeast g1)
   changed: (col g1) from 6 to 4, (row g1) from 90 to 88
   goals met: 1 of 2
98. (drift_southeast g1)
   changed: (col g1) from 4 to 2, (row g1) from 88 to 86
   goals met: 1 of 2
99. (drift_southeast g1)
   changed: (col g1) from 2 to 0, (row g1) from 86 to 84
   goals met: 1 of 2
100. (rescue_passenger g1 r1)
   added: (rescued r1)
   goals met: 2 of 2
